Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: རྗེས་སུ་འཐུན་འདི་སྤྱོད་པ་སྤྱད་བྱས་ཤིང་། །ཞིང་མཆོག་དག་ཀྱང་ཡོངས་སུ་སྦྱངས་ནས་སུ། །མ་འོངས་དུས་སུ་སངས་རྒྱས་འགྱུར་བ་སྟེ། །
en: “Practicing in this manner “And purifying supreme realms, In the future you will become a buddha [Who is more famous than the moon, And liberate beings who roam in existence.”]

source: ཟླ་བས་ལྷག་པར་ཕྱོགས་སུ་རྣམ་གྲགས་ཤིང་། །སྲིད་པར་འགྲོ་བའི་སེམས་ཅན་ཐར་བར་བྱེད། །
en: [“And purifying supreme realms, In the future you will become a buddha ]Who is more famous than the moon, And liberate beings who roam in existence.”

source: ཀམ་པ་ལ་ཞེས་མིང་བཏགས་ཀླུ་དེ་ནི། །ཤཱཀྱ་སྲས་མཁས་བྱང་ཆུབ་ལུང་བསྟན་ནས། །སེམས་ནི་དགའ་ཞིང་ཡོངས་སུ་ཡིད་མགུ་སྟེ། །འགྲོ་ཀུན་ཐར་བར་མཛད་ལ་མངོན་བསྟོད་པ། །
en: When the awakening of the nāga named Kambala Was thus prophesied by the wise Son of the Śākyas, He became thrilled and overjoyed, And praised the liberator of all beings:

source: ཐུབ་པ་ཆེ་ལ་འདི་ལྟར་སྐྱབས་སུ་མཆི། །
en: “Great sage, I take you as my refuge.

source: སངས་རྒྱས་འགྱུར་བར་ཐེ་ཚོམ་བདག་མ་མཆིས། །
en: I have no doubt that you are a buddha.

source: མུན་པ་དག་ལ་སྒྲོན་མ་གཟུང་བགྱི་ཞིང་། །ལོང་བ་མིག་མ་མཆིས་ལ་ལམ་བསྟན་བགྱི། །
en: You hold the lamp for those in darkness And show the way for the sightless.”

source: དེ་ནས་ཀླུའི་བདག་པོ་ཡུལ་འཁོར་སྲུང་གིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Next the lord of nāgas named Dhṛtarāṣṭra asked the Blessed One in these melodious verses:

source: མགོན་པོ་འཇིག་རྟེན་ལོང་བར་གྱུར་པའི་མིག །མིག་སྦྱིན་སྨན་པ་དྲང་སྲོང་ཆེ་ལ་ཞུ། །
en: “O Guardian, great sage, doctor who gives sight To the eyes of blind beings, I ask you:

source: གང་གིས་འཇིག་རྟེན་རྣམ་ཐར་ལམ་བཟང་ཞིང་། །ཞི་བའི་སར་མཆིས་རྐང་གཉིས་དབང་པོ་གསུངས། །
en: Please say, O lord of humans, what allows one to traverse the path Of freedom from the world, and reach the state of peace?”

source: སྟོབས་བཅུའི་སྟོབས་མངའ་རྣམ་པར་ཐར་བའི་ལམ་སྟོན་པ། །འཇིག་རྟེན་མགོན་པོ་རྐང་གཉིས་དབང་པོས་དེ་ལུང་བསྟན། །
en: The teacher of the path to liberation who possesses the strength of the ten powers, The guardian of the world and lord of humans, then replied,

source: གང་གིས་ཡུན་རིང་ཞུགས་པའི་སྡུག་བསྔལ་ལམ་ཞི་ཞིང་། །འཁོར་བ་ཉེར་ཞི་མྱ་ངན་འདས་པ་གསལ་བར་འགྲོ། །
en: “He who calms the path of suffering that has so long been tread, And pacifies cyclic existence, will clearly reach nirvāṇa.”

source: སྟོན་ལ་ཀླུ་ཡི་རྒྱལ་པོ་ལམ་ཞི་ཐོས་ནས་སུ། །སྡུག་བསྔལ་བ་ལ་སྙིང་རྗེ་དམ་པ་བསྐྱེད་བྱས་ཤིང་། །ཀླུ་ཡི་རྒྱལ་པོས་བྱང་ཆུབ་འདུན་པ་དྲག་བསྐྱེད་དེ། །
en: When the nāga king heard of the peaceful path from the Teacher, He felt genuine compassion for those who are suffering. The nāga king gained a deep yearning for awakening, And said,

source: སྟོབས་བཅུའི་སྟོབས་འཆང་འཇིག་རྟེན་མགོན་དུ་བདག་འགྱུར་བྱེད། །
en: “I will become a guardian of beings and gain the strength of the ten powers.”

source: སྟོབས་བཅུའི་ཡོན་ཏན་མངའ་བས་ཀླུ་དབང་ལུང་བསྟན་པ། །
en: He who possesses the qualities of the ten powers then prophesied of the nāga lord:

source: མི་ཡི་སེང་གེ་བདག་ཉིད་མུ་སྟེགས་དགྲར་འགྱུར་ཞིང་། །
en: “You will become a lion among men, an adversary of extremists.

source: སེམས་ཅན་མཐའ་ཡས་དཔག་མེད་འཁོར་བར་འགྲོ་བ་དག །བདེ་གཤེགས་མཆོག་གི་ཚིག་གིས་འདྲེན་ཅིང་ཐར་བར་བྱེད། །
en: With the sublime words of the Blissful One, you will guide and liberate An infinite, unfathomable number of beings wandering in cyclic existence.”

source: སྟོན་པའི་གསུང་མཆོག་ཀླུ་ཡི་རྒྱལ་པོས་ཐོས་ནས་སུ། །དགའ་བའི་སེམས་ཀྱིས་སོར་བཅུའི་རྩེ་མོ་ཐལ་སྦྱར་ཏེ། །
en: When the nāga king heard the Teacher’s sublime words He joyfully brought his ten fingertips together, And

source: མི་དབང་འཇིག་རྟེན་མགོན་པོ་དྲང་སྲོང་ཆེན་པོ་ལ། །གུས་པ་བསྐྱེད་ནས་འཁྲུལ་མེད་ཚིག་གིས་མངོན་བསྟོད་པ། །
en: out of respect for the lord of men, the protector of the world, the great sage, He praised him with these unmistaken words:

source: སྐྱབས་མཆོག་ཤིན་ཏུ་ཐུགས་གཞུངས་མཚུངས་མེད་ཡེ་ཤེས་ཏོག །འགྲོ་བའི་དགེ་བ་སྤྱོད་ཅིང་དགེ་ལ་ཡུན་རིང་དང་། །འགྲོ་བའི་བསམ་པ་མཐའ་ཡས་ཁྱོད་ཀྱིས་ཐུགས་ཆུད་པས། །དེས་ན་མི་དབང་ཁྱོད་ནི་འཇིག་རྟེན་རྒྱ་ཆེར་གྲགས། །
en: “Supreme refuge, with your extraordinary mind, apex of peerless wisdom, You are aware of the infinite thoughts of beings, Their virtuous deeds, and the duration of that virtue— Thus, lord of men, you are renowned throughout the world.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་གསེར་མགྲིན་གྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Next the nāga king Golden Throat inquired thus of the Blessed One in these melodious verses:

source: སྟོབས་བཅུའི་སྟོབས་མངའ་སྟོབས་ཆེ་སྟོབས་དང་ལྡན་པ་སྟེ། །
en: “You who has the strength of the ten powers and possesses the power of great strength,

source: ཐུགས་དགེ་སྣང་མཛད་འོད་དང་ལྡན་ཞིང་སྡིག་མི་མངའ། །
en: Your virtuous mind, radiant , illuminates and is bereft of any evil.

source: སྲིད་རྒྱལ་བློ་གྲོས་བཟང་བས་འགྲོ་བ་ཤིན་ཏུ་མཁྱེན། །
en: Victorious over existence, with superior intellect you truly understand beings—

source: རྒྱལ་བ་དགེ་སྤྱོད་ཤིན་ཏུ་དྲི་མེད་ཞལ་གསུངས་ཤིག །
en: O Victor, please explain what immaculate, virtuous practice is.

source: མི་མཆོག་རྡུལ་བྲལ་ཁྱོད་སྲས་ཇི་ལྟར་སྤྱད་བགྱིས་ན། །མཁས་པ་མ་དཀྲུགས་མ་བསྐྱོད་པ་དག་ཐུགས་ཆུད་ཅིང་། །རྒྱལ་བ་རྡུལ་བྲལ་དཔག་མེད་བརྒྱ་ནི་ཡོངས་སུ་མཁྱེན། །རྒྱལ་སྲས་སྐྱེ་བོ་ཕན་མཛད་ཐུགས་སུ་ཆུད་པའི་སྤྱན། །
en: “You who is flawless and supreme among men, how should your child practice To gain the realization of the undisturbed, unshakably wise, The knowledge of the unfathomably many flawless victors, And the eyes of realization with which the Victor’s heirs benefit beings?

source: བློ་གྲོས་དཔག་མེད་མངའ་བ་ལྷ་མི་མཁས་པ་ཡིས། །བླ་མར་བགྱིས་ཤིང་རྒྱལ་བ་དཔག་མེད་ས་ཡས་བསྐོར། །
en: “Your intelligence is unfathomable; you are the master of learned gods and humans, Surrounded by unfathomable millions of victors.

source: མཁས་པ་དུས་སུ་འགྲོ་བ་དཔག་མེད་ཕན་མཛད་དགོངས། །
en: O wise one, please think at this time of the benefit for countless beings.”

source: སྟོབས་བཅུ་མངའ་བ་ཀླུ་ཡི་འགྲོ་བ་ཞུས་པ་གསུངས། །
en: The nāga thus requested the master of the ten powers.

source: བློ་འཆལ་བྲལ་ཞིང་བློ་གཙང་རྗེས་དགོངས་བརྟག་པ་མཛོད། །
en: “With a mind that is unmistaken and pure, carefully analyze this.

source: ང་ཡི་སྲས་མཆོག་རྒྱལ་བསྟེན་རྒ་ཤི་ཟད་བྱེད་པ། །འཐོབ་ཅིང་རྒྱལ་བས་མཆོད་ཅིང་རྡུལ་མེད་སྐྱོན་བྲལ་རེ། །
en: My supreme children follow the Victor and achieve the end of old age and death. The victors serve them and they are flawless and immaculate.

source: འགྲོ་བའི་སྡུག་བསྔལ་དཔག་མེད་བརྒྱ་ཤེས་ཡོངས་སུ་འགྲོ་ལ། །
en: They understand the suffering of unfathomably many beings, and free them.”

source: སྟོབས་བཅུ་བློ་གྲོས་མངའ་བས་ཀླུ་ཡི་བདག་པོ་ཡིས། །རྒ་ཤི་ཟད་བྱ་ཐོས་ནས་རབ་ཏུ་ཡིད་དགའ་སྟེ
en: When the lord of nāgas heard about the cessation of old age and death, Spoken of by the master with the intelligence of the ten powers, he was delighted.

source: འགྲོ་ལ་ཕན་ཡིད་བྱང་ཆུབ་ཡིད་བྱས་རྒྱལ་བའི་མཆོག ། རྣམ་འདྲེན་བློ་མངའ་འགྲོ་ལ་ཕན་མཛད་མངོན་བསྟོད་པ། །
en: With his mind set on awakening and helping beings, he praised the supreme Victor, The one who benefits beings with the mind-set of a guide:

source: འགྲོ་བ་མང་པོའི་མུན་པ་རབ་རིབ་ལིང་ཏོག་དག །གཅོད་མཛད་འགྲོ་འདིའི་སྡུག་བསྔལ་འཇོམས་ཤིང་མུན་པ་དང་། །རབ་རིབ་ལིང་ཏོག་ཀུན་ནས་སེལ་མཛད་བདུད་རྩིའི་ལམ། །ཤིན་ཏུ་དྲི་མེད་སྤྱན་མངའ་དགེ་བ་ཕྱོགས་བཅུར་སྟོན། །
en: “You eliminate so many beings’ darkness, clouded vision, and cataracts, Eradicating their suffering. Thoroughly dispelling their darkness, Clouded vision, and cataracts with the ambrosial path, With your flawless vision you teach virtue throughout the ten directions.

source: ཀླུ་ཡི་བདག་པོའི་གསེར་དངུལ་ལྟ་བུའི་ཁྱིམ་གཤེགས་ཤིང་། །
en: “You have come to a house similar to the nāga lord’s gold and silver mansion.

source: ཡོན་ཏན་དཔག་མེད་མངའ་བ་ཤིན་ཏུ་ཐུགས་སུ་ཆུད། །
en: Extremely realized, you possess boundless qualities.

source: བློ་གྲོས་སྟོན་མཛད་འོད་ཟེར་སྟོང་འདྲའི་སྤྱན་མངའ་ཞལ། །
en: The eyes on your face shine with intelligence, like a thousand light rays.

source: མ་འཁྲུལ་མ་གློངས་མ་སྨད་གཟི་ཆེ་མཁས་པའི་གཟི། །
en: Your great splendor of knowledge is unconfused, undisturbed, and irreproachable.

source: སྟོབས་བཅུ་འོད་ཆེན་མངའ་ལ་འགྲོ་བའི་ཚིག་གིས་བསྟོད། །
en: “I praise you who has the light of the ten powers, with the words of beings.

source: རྒྱལ་མཆོག་བདག་ཉིད་བདེ་ལྡན་སངས་རྒྱས་བྱང་ཆུབ་ནས། །འགྲོ་བ་འཁྱམས་ཤིང་མངོན་མེད་རྒ་ཤི་སྡུག་བསྔལ་གྱིས། །ཉམ་ཐག་སྡུག་བསྔལ་དཔག་མེད་བསལ་ཏེ་ཐར་བར་བགྱི། །
en: Supreme Victor, I will awaken to blissful buddhahood And then dispel the limitless suffering of wandering beings Stricken by the invisible sufferings of aging and death—I will free them!”

source: བདེ་དང་ཞི་དང་ཞི་བ་རྡུལ་མེད་རྒྱ་ཆེ་སེལ། །ཞི་བའི་ལམ་དུ་ཞུགས་ནས་བདག་ནི་སངས་རྒྱས་བགྱི། །
en: “Clearing away bliss, peace, and immense and immaculate peace, I will awaken by following the path of peace.

source: རྒྱལ་བ་བརྒྱ་ཡིས་ཐུགས་ཆུད་བདུད་ཀྱི་སྟོབས་དག་ནི། །སྟོབས་མེད་བགྱི་ཞིང་མི་མཁས་པ་དག་གཞུག་པར་བགྱི། །
en: As realized by one hundred victors, I will immobilize The force of Māra and engage with those who do not know.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མགྲིན་སྔོན་གྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king named Nīlagrīva asked of the Blessed One in the form of a song in verse:

source: སྟོན་མཆོག་མི་འདུལ་ཁ་ལོ་སྒྱུར་ལ་ཞུ་བགྱི་བ། །
en: “Supreme Teacher, steersman for the untamed, I ask you:

source: འདྲེན་པ་ཁྱོད་ཀྱི་སྲས་ནི་ཇི་ལྟར་སྤྱད་བགྱིས་ནཁ་ན་མ་ཐོ་མེད་ཅིང་ཞི་ལ་རྡུལ་བྲལ་དང་། །ཉོན་མོངས་མེད་ཅིང་བྱང་ཆུབ་དམ་པ་སངས་རྒྱས་འགྱུར། །
en: O Guide, how should your child practice To become free of unwholesomeness, at peace, stainless, And free of affliction, and awaken to true buddhahood?

source: འགྲོ་བའི་དོན་དུ་འདྲེན་པས་གསུངས་པ་གང་། །དཔའ་བོ་ཁྱོད་ཉིད་ལས་འཁྲུངས་སྲས་ཐོས་ནས། །ཁ་ན་མ་ཐོ་མེད་ཅིང་བདག་དང་གཞན། །སངས་རྒྱས་འགྱུར་དང་བྱང་ཆུབ་ཐེ་ཚོམ་ཁུམ། །
en: “When, O hero, your progeny hears What the Guide says for the sake of beings, I will become free of unwholesomeness, and both I and others Will become buddhas, as doubts about awakening withdraw.”

source: མགྲིན་སྔོན་ཀླུ་དེ་ཡིས་ནི་ཞུས་པ་དང་། །འཇིག་རྟེན་ཀུན་ལ་ཆགས་པ་མེད་པའི་ཐུགས། །ཆོས་རྣམས་ཀུན་ལ་མི་འཇིགས་དབང་བརྙེས་ཤིང་། །སྟོན་པའི་གསུང་ལ་ལེགས་གནས་ལུང་བསྟན་པ། །
en: When the nāga Nīlagrīva asked this question He whose mind is without attachment to the entire world, Who attained the power of not being afraid of anything, And who is steadfast in the speech of a guide, replied,

source: ང་སྲས་འཇིག་རྟེན་གསུམ་ལ་མ་ཆགས་ཤིང་། །འགྲོ་ལ་ཕན་པར་སྤྱད་པ་སྤྱོད་བྱེད་པ། །འདོད་པའི་ཁམས་དང་གཟུགས་ཀྱི་ཁམས་དག་དང་། །གཟུགས་མེད་ཁམས་སུའང་ཆེད་དུ་མི་སྐྱེའོ། །
en: “My children have no attachment for the three realms; They carry out actions to benefit beings. They are not born for the sake of the desire realm, Nor the form or formless realms.

source: མྱ་ངན་འདས་དབྱིངས་གཞལ་མེད་འདུས་མ་བྱས། །ཐམས་ཅད་ཀྱི་ནི་སྡུག་བསྔལ་ཟད་ཅིང་འགོག །
en: “The realm of nirvāṇa, immeasurable and unconditioned— It ends and ceases the suffering of all.

source: དེ་ནི་ཉེར་བཟུང་འཇིག་རྟེན་གོས་མེད་ཡིན། །
en: Upholding this, they are not polluted by the world.

source: རྒྱལ་བ་རྒྱལ་བའི་དབང་པོ་རབ་ཏུ་བསྒོམ། །
en: They meditate on the victorious lord of victors.

source: དེ་ཡིས་ལེགས་པའི་ལས་དེ་བྱས་པས་ན། །གོས་པ་མེད་ཅིང་འཇིགས་མེད་རྣམ་སྤྱོད་ལ། །
en: “As they carry out such positive actions, They act without pollution or fear,

source: བདག་དང་གཞན་ལ་གནོད་པ་མེད་གནས་ཏེ། །
en: Living without harming themselves or others,

source: བདག་ཉིད་བླ་མེད་བྱང་ཆུབ་མངོན་འཚང་རྒྱ། །
en: Until they fully awaken to unexcelled buddhahood.

source: དེ་ནི་རྣམ་སྨིན་དེ་ལས་རྗེས་འཐུན་པ། །ཤིན་ཏུ་དཀའ་བས་བྱང་ཆུབ་འཚང་རྒྱར་འགྱུར། །
en: “Such ripening is in tune with the initial actions: Through immense hardships they awaken to buddhahood.

source: དེ་ཡི་སྐྱེ་བོ་སྲོག་ཆགས་ལྷ་དང་ཀླུ། །མི་དང་སྲིན་པོ་དག་གིས་མི་མཐོང་ངོ་། །
en: Yet this is invisible to sentient beings Like gods, nāgas, humans, and rākṣasas.”

source: ཀླུ་མགྲིན་སྔོན་པོ་སྟོབས་པོ་ཆེ་དེ་ནི། །སངས་རྒྱས་ཀུན་མཁྱེན་གསུང་གིས་དགའ་གྱུར་ནས། །
en: The mighty nāga Nīlagrīva Was delighted by the omniscient Buddha’s words.

source: སོར་མོ་བཅུ་ཡི་ཐལ་སྦྱར་མགོ་བཏུད་དེ། །འཇིག་རྟེན་སྒྲོན་མཛད་འདྲེན་ལ་ཕྱག་འཚལ་བྱེད། །
en: He brought together his ten fingers and bowed his head In homage to the Guide, the lamp of the world:

source: མི་མཆོག་ལ་ནི་འདི་ལྟར་བདག་སྐྱབས་མཆི། །
en: “I thus take refuge in the foremost of humans.

source: ཡབ་ཀྱི་རྗེས་སུ་སྲས་ཀྱང་མཆི་བགྱི་ཞིང་། །མཐར་བགྱིད་བཅོམ་ལ་བྱང་ཆུབ་འཚང་རྒྱར་བགྱི། །
en: This child will follow after his father, Reach the end, triumphant, awaken to buddhahood, And

source: སེམས་ཅན་སྡུག་བསྔལ་ཆོས་ཀྱིས་གནོད་གྱུར་དགྲོལ། །
en: liberate beings by destroying their suffering with the Dharma.”

source: ཁྱོད་ནི་མ་འོངས་དུས་སུ་འཚང་རྒྱ་སྟེ། །
en: “In the future, you will awaken.

source: ཀུན་ཏུ་སྤྱན་ཞེས་ཕྱོགས་སུ་རྣམ་གྲགས་ཤིང་། །
en: Your name, All-Seeing, will be renowned in all directions.

source: འགྲོ་བའི་སྲིད་ལས་སེམས་ཅན་གྲོལ་བར་བྱེད། །
en: You will liberate beings from wandering existence.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་འཇིགས་སྒྲོགས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Terrifying asked the Blessed One in the form of a song in verse:

source: མི་འདུལ་ཁ་ལོ་སྒྱུར་བ་ཡིད་ལས་འདས། །སྟོན་པ་སུག་ལས་ཅི་བགྱིས་བདག་ཞུའོ། །
en: “Incredible steersman for the untamed, O Teacher, I ask you what deeds you performed

source: རྒྱལ་བ་དེ་ནི་སྣམ་ཕྱོགས་གཟིགས་པ་ན། །དཀྱིལ་འཁོར་ཙམ་གྱིས་ནི་མདུན་དུ་འགྱུར། །
en: Such that when the Victor surveys the land, Countries appear before you?”

source: ཆོས་ལ་ངེས་པའི་རྒྱལ་བས་དེ་ལུང་བསྟན། །
en: The Victor with his conviction in the Dharma, replied.

source: ཀུན་མཁྱེན་མཁྱེན་པས་བསམ་པ་ཐུགས་ཆུད་ནས། །བླ་ན་མེད་པའི་ཐུགས་ནི་བསྐྱེད་མཛད་དེ། །དེ་བཞིན་མི་མཆོག་གིས་ནི་འདི་ལུང་བསྟན། །
en: With his omniscient wisdom, aware of his thoughts, Giving rise to an extraordinary mind-set, The foremost of humans then explained,

source: བདེ་བ་འབྱུང་བ་དག་གི་ལས་བྱས་ཤིང་། །དེ་དག་སྔན་ཆད་ཡང་དང་ཡང་དྲན་པས། །དེ་ཡི་རྣམ་སྨིན་ལས་ནི་འདི་ལྟར་ཤེས། །
en: “By carrying out actions that lead to happiness, And by bringing the past to mind again and again, I know what comes from their ripening;

source: དེ་ཡི་གཟིགས་པ་རས་ནི་འགྱུར་བ་ཡིན། །
en: In that vision appear places.”

source: རྒྱལ་བས་ལེགས་གསུངས་ཚིག་ནི་ཐོས་ནས་སུ། །ཀླུ་རྒྱལ་དེ་ནི་མཆོག་ཏུ་དགའ་གྱུར་ནས། །འཕགས་པའི་ཟང་ཟིང་མེད་པའི་དགའ་བསྐྱེད་དེ། །
en: Upon hearing the Victor’s sublime words, The nāga king was overjoyed, Felt the spiritual delight of the noble ones, And,

source: ང་རྒྱལ་བཅོམ་ནས་སངས་རྒྱས་ཕྱག་འཚལ་བྱེད། །
en: overcoming his pride, paid homage to the Buddha.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་གཟི་ཅན་གྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Manasvin asked the Blessed One in the form of a song in verse:

source: ལམ་སྟོར་བ་ལ་ལམ་ནི་རབ་སྟོན་ཅིང་། །འཇིག་རྟེན་དོན་མཛད་འདྲེན་ལ་ཞུ་བགྱི་བ། །
en: “You who show the way for those who have lost their path, Guide who benefits the world, I ask you:

source: སྔོན་ཚེ་རྟག་ཏུ་ཕྲིན་ལས་ཅི་མཛད་ནཇི་ལྟར་དགོངས་པ་བཞིན་དུ་ཞི་གནས་མཛད། །
en: What actions did you constantly carry out before, That you can remain in tranquility according to your wish?”

source: འཇིག་རྟེན་མགོན་པོ་རྒྱལ་བས་དེ་ལུང་བསྟན། །
en: The Victor and Guardian of the World responded.

source: སེམས་ཅན་ཀླུ་ནི་གདུལ་བའི་དུས་བབ་ཅིང་། །འགྲོ་བ་ཐམས་ཅད་ལ་ནི་ཕན་པའི་ཕྱིར། །འདྲེན་པ་བདུད་སྟོབས་འཇོམས་པས་ལུང་བསྟན་པ། །
en: The time for the nāga to be tamed had come, So in order to benefit all beings, And having vanquished the force of Māra, the Guide explained,

source: འདས་པའི་དུས་སུ་སྤྱད་པ་སྤྱོད་པའི་ཚེ། །ཚུལ་བཞིན་མ་ཡིན་སེམས་དང་གཉེན་མིན་པའི། །ནམས་ཀྱང་མི་སེམས་རྟག་ཏུ་ཞི་གནས་བསྟེན། །དེ་ལ་ངས་ནི་ཡུན་རིང་བསླབས་པ་ཡིན། །
en: “When I was training in the past I never had thoughts that were improper or unfriendly, And always remained in tranquility, Practicing that way for a long time.

source: དེ་བཞིན་རྒྱལ་བ་དག་གི་མཆོད་རྟེན་ལ། །ཕྲེང་བ་རིན་ཆེན་དག་ནི་བཀྲམ་ཞིང་ཕུལ། །
en: “Similarly, at reliquaries of the victors I arranged and offered garlands and jewels.

source: དེ་ཡིས་ལེགས་པའི་ལས་དེ་བྱས་པས་ན། །ཉོན་མོངས་སེམས་དང་ནམས་ཀྱང་མི་གནས་སོ། །
en: Carrying out such positive actions, I never dwelled in afflicted mind-states.

source: ང་ཡིས་བསྐལ་པ་སྟོང་ཕྲག་བྱེ་བ་རུ། །གཞན་ལ་གནོད་པས་ནམས་ཀྱང་གནོད་མ་བྱས། །
en: “For ten billion eons I never even harmed another being.

source: ང་ནི་དེ་ཡིས་ལས་ཀྱི་རྣམ་སྨིན་རྒྱུས། །ཇི་ལྟར་བསམས་བཞིན་ཞི་གནས་སྟེན་པར་བྱེད། །
en: These actions of mine, when ripened, led me To be able to remain tranquil as long as I wish.”

source: དྲང་སྲོང་ཆེ་བས་ལུང་བསྟན་འདི་ཐོས་ནས། །གཟི་ཅན་ཀླུ་ནི་དགའ་བར་གྱུར་པ་ན། །
en: Hearing the words of the great sage, Manasvin the nāga was delighted.

source: གཞལ་དུ་མེད་པའི་བདེ་བས་སེམས་དགའ་ནས། །སྟོན་པའི་མདུན་འདུག་ཚིགས་སུ་བཅད་པས་བསྟོད། །
en: In a state of immeasurable happiness, he joyfully sat In front of the Teacher and praised him in verse:

source: འགྲོ་བའི་ཀུན་ལྡང་ཉོན་མོངས་ཞི་མཛད་ཅིང་། །དེ་དག་སེམས་ཞི་ཁྱོད་ཀྱི་བསྟན་པ་མཛད། །
en: “You pacify the afflictions that arise in beings And teach them how to calm their minds.

source: ཐུབ་པ་ཉོན་མོངས་མེད་པར་འཇིག་རྟེན་སྤྱོད། །
en: O Sage, you engage with the world while free of affliction.

source: ཟླ་འོད་ལྟ་བུར་བློ་ཞི་ཕྱག་འཚལ་ལོ། །
en: I bow to the one whose mind is calm as moonlight.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བྱེད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Vairocana asked the Blessed One in the form of a song in verse:

source: སྔོན་ཚེ་དག་ཏུ་ཕྲིན་ལས་ཅི་མཛད་ན། །ཐུབ་པ་ཁྱོད་ཀྱིས་སྐུ་ལ་རྡུལ་མི་གོས། །
en: “What actions did you perform in the past, O Sage, that made your body so untainted?

source: དཔེ་མེད་རྣམས་གནོན་འདི་དག་བདག་ལ་གསུངས། །
en: Please explain these matchless and astounding things—

source: གང་དག་ཐོས་ནས་དགེ་བའི་ལས་སྤྱད་བགྱི། །
en: Once I’ve heard, I’ll practice virtuous deeds!”

source: རྣམ་པར་སྣང་བྱེད་དགེ་བ་ཚོལ་བའི་ཀླུས། །འཇིག་རྟེན་མགོན་དེ་ལ་ནི་ཞུས་པ་དང་། །ཉོན་མོངས་ཀུན་སེལ་ཡན་ལག་བརྒྱད་ལྡན་ཞིང་། །སྙན་ཅིང་འཇེབས་པའི་སྒྲས་ནི་ལུང་བསྟན་པ། །
en: Thus Vairocana, a nāga in pursuit of virtue, Asked the Guardian of the World, Who replied, with sweet and pleasant words With eight qualities, to remove all afflictions:

source: ང་ཡིས་སྔོན་ཆད་བྱང་ཆུབ་ཚོལ་བ་ན། །
en: “When I was pursuing awakening in the past,

source: ནམས་ཀྱང་ཚུལ་བཞིན་མ་ཡིན་ངས་མ་བསམས། །
en: I never had an improper thought.

source: ནམས་ཀྱང་རབ་ཏུ་ཉེས་སེམས་ངས་མ་བསྐྱེད། །བླ་མེད་བྱམས་ལས་ཡང་དང་ཡང་དུ་བྱས། །
en: I never thought anything wicked, But over and over acted out of utmost love.

source: ང་ཡིས་དགེ་བའི་ལས་དེ་བྱས་པས་ན། །བླ་མེད་བྱང་ཆུབ་ཞི་བ་རེག་ནས་སུ། །མི་མཆོག་རྒྱལ་བ་ཐུབ་པའི་སྐུ་དག་དང་། །ན་བཟའ་ལ་ཡང་རྡུལ་གྱིས་མི་གོས་སོ། །
en: “Because I did such virtuous things, When I reached unexcelled awakening, My body as the foremost human, victor, and sage, And even my clothes, have never been blemished.”

source: རྒྱལ་བའི་ཕྲིན་ལས་དགེ་བསགས་དེ་ཐོས་ནས། །རྣམ་པར་སྣང་བྱེད་ཀླུ་ནི་ཡིད་དགའ་སྟེ། །
en: Hearing how the Victor had gathered virtuous actions, Vairocana the nāga was delighted.

source: སོར་བཅུའི་ཐལ་མོ་སྦྱར་ནས་མགོ་བོ་ཡིས། །རྒྱལ་བའི་ཞབས་ལ་མངོན་པར་ཕྱག་འཚལ་བྱེད། །
en: Bringing his ten fingers together, he bowed His head to the Victor’s feet.

source: ལེགས་སོ་རྒྱལ་བ་མུ་བྱེད་སྔོན་དུ་གཤེགས། །
en: “Excellent! O Victor, you have already gone to the end.

source: ཁྱོད་ཀྱིས་རྒྱ་ཆེ་མཐའ་ཡས་དོན་དག་མཛད། །
en: You benefit in a vast and infinite way.

source: སྲིད་པའི་ཚོགས་ལ་དགའ་ཞིང་སྡུག་བསྔལ་གྱིས། །གདུངས་པའི་འགྲོ་བ་མཐའ་དག་ཁྱོད་ཀྱིས་བཀྲོལ། །
en: You liberate every being who is stricken with suffering And who takes pleasure in existence.

source: སྐྱེ་བོ་དུག་གདུག་རིག་པའི་སྨན་པ་སྟེ། །སྐྱེ་བོ་དུག་བཅོམ་ཁྱོད་ནི་གསོ་སྨན་ལགས། །མེ་འབར་ཞི་ལྟར་རིམ་གྱིས་མྱ་ངན་འདའ། །
en: “You are the doctor of knowledge for poisoned beings, Providing the remedy to cure beings’ poison, Eventually bringing them to nirvāṇa as if putting out a fire.

source: འདི་ལྟར་ཐལ་སྦྱར་མགོས་བཏུད་སྐྱབས་སུ་མཆི། །
en: Thus do I bring my palms together and take refuge.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་བསྒྱིངས་པས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ། །
en: Then the nāga king Haughty One asked the Blessed One in the form of a song in verse:

source: རྣམ་འདྲེན་དགེ་བའི་ཕྲིན་ལས་ཅི་མཛད་ནཞབས་ནི་ཤིན་ཏུ་མཉམ་ཞིང་བརྟན་པ་བརྙེས། །
en: “O Guide, what deeds did you perform So that you gained such firm and utterly flat feet?

source: གང་དག་ཐོས་ནས་ཤིན་ཏུ་ཡིད་དགའ་འཐོབ། །མི་ཡི་མཆོག་གྱུར་དེ་དག་བདག་ལ་གསུངས། །
en: To hear an answer will bring me joy, So please tell me, foremost of humans.”

source: ཀླུ་ཡི་རྒྱལ་པོ་བསྒྱིངས་པས་རྣམ་པར་འདྲེན། །འཇིག་རྟེན་མཁས་ལ་དེ་ཡིས་ཞུས་པ་དང་། །
en: Thus did the nāga king Haughty One ask The Guide and Knower of the World.

source: ཡིད་དུ་འོང་བའི་ཚིགས་བཅད་སྣ་ཚོགས་ཀྱིས། །ཀླུ་ཡི་རྒྱལ་པོ་ཡིད་ནི་དགའ་བར་གྱུར། །
en: Then the nāga king was delighted By this beautiful verse:

source: ང་ཡིས་ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་རྣམ་དག་བསྒྲུབས། །
en: “I achieved utter discipline in my conduct.

source: ང་ཡིས་གཞན་ཡང་ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་བསྒོམས།
en: I also trained in utter discipline in conduct.

source: ངས་ནི་དགེ་བའི་ལས་དེ་བྱས་པས་ན། །རྐང་པ་མཉམ་པ་དག་གིས་ས་ལ་རེག །
en: Because I performed such virtuous deeds, I touch the ground with flat feet.”

source: དེ་ཚེ་ཐམས་ཅད་མཁྱེན་པས་ལུང་བསྟན་པ། །
en: Thus did the Omniscient One then explain.

source: རྡུལ་བྲལ་ཀླུ་ནི་ཡིད་དགའ་མགུ་གྱུར་ནས། །གཞལ་དུ་མེད་པའི་བདེ་བས་སེམས་དགའ་སྟེ། །
en: The nāga Viraja was delighted, His mind filled with immeasurable joy.

source: ལེགས་སོ་རྒྱལ་བ་འོད་མཛད་རྡུལ་བཅོམ་ཞིང་། །ཤིན་ཏུ་ཉོན་མོངས་བག་ཆགས་བཅས་པ་བཅོམ། །
en: “Excellent! Luminous Victor, you have overcome flaws, And vanquished afflictions and the habits for them.

source: ཟླ་ཉའི་དཀྱིལ་འཁོར་སྒྲ་གཅན་གྱིས་བཏང་ལྟར། །དགྲ་བཅོམ་ནས་ནི་ཕྱོགས་རྣམས་རབ་ཏུ་གསལ། །
en: Just like an eclipse consuming the moon, You have conquered the enemy and illuminated all directions.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་འོད་ཆེན་གྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Mahāprabha asked the Blessed One in the form of a song in verse:

source: ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་སྨན་སླད་དུ། །འཇིག་རྟེན་འདས་གསུང་འདྲེན་ལ་ཞུ་བགྱི་བ། །
en: “In order to aid the whole world including the gods, I ask you, O Guide, with your supramundane speech:

source: རྐང་གཉིས་དམ་པ་སུག་ལས་ཅི་བགྱིས་ནརྣམ་འདྲེན་གནས་མ་ལགས་པ་འཚལ་བ་འཐོབ། །
en: What deeds did you perform, most sublime of humans, That led you, O Guide, to achieve knowledge of what is impossible?”

source: སྔོན་ཚེ་དག་ཏུ་སྤྱད་པ་སྤྱོད་པ་ན། །ལུས་དང་ངག་ཡིད་དང་ནི་སེམས་ཀྱིས་ཀྱང་། །བདེ་བ་འབྱུང་བའི་ཡང་དག་ལས་བྱས་ཏེ། །
en: “When I was practicing in the past, I carried out deeds that led to happiness With my body, my speech, and even my mind.

source: ལས་གང་བྱས་པས་ནམས་ཀྱང་གདུང་མི་འགྱུར། །
en: None of my actions ever led to pain.

source: རབ་ཏུ་དགའ་ཞིང་དགེ་བས་བརླན་པ་དང་། །གནས་མ་ཡིན་པའི་ལམ་གྱོད་ཐམས་ཅད་ནི། །དགེ་བཅུ་ལས་ཀྱི་ལམ་གྱིས་རྣམ་པར་སྦྱངས། །
en: “With pleasure, saturated by virtue, I refined away all faults of the path of what is impossible With the path of the ten virtuous actions, And

source: གནས་མ་ཡིན་པའི་ཉོན་མོངས་ཐམས་ཅད་བཅོམ། །
en: conquered all afflictions related to the impossible.”

source: རྣམ་འདྲེན་དེ་ཡིས་ལས་དེ་མཛད་པས་ན། །འདི་ནས་འཕོས་ནས་གཞན་འཕྲུལ་དག་ཏུ་གཤེགས། །
en: Because the Guide performed these deeds, when passing from that life, He went to the Heaven of Making Use of Others’ Emanations.

source: མི་ཡི་འཇིག་རྟེན་བརྙེས་ནས་དེར་འདས་ཏེ། །
en: Then upon reaching the world of humans, he transcended, And

source: བླ་མེད་གནས་མ་ཡིན་པ་ཤེས་པ་འཐོབ། །
en: achieved unsurpassed knowledge of what is impossible.

source: གནས་མ་ཡིན་པ་ཤེས་ལ་ནམས་ཀྱང་ནི། །བྱེ་བ་ཁྲག་ཁྲིག་བདུད་ཀྱིས་བསྐྱོད་མི་ནུས། །
en: This knowledge of what is impossible Could never be disturbed even by one quintillion demons.

source: སེམས་དང་དེ་བཞིན་ཉོན་མོངས་ཡིད་གྲོལ་ཏེ། །དེ་བཞིན་གཤེགས་པས་འགྲོ་ཀུན་རབ་ཏུ་མཁྱེན། །
en: Mind and afflicted concepts being liberated, The Thus-Gone One fully knows all beings.

source: སྟོན་པས་ལུང་བསྟན་པས་ནི་འོད་ཆེན་ཀླུ། །ཡིད་ནི་མགུ་ཞིང་ཤིན་ཏུ་དགའ་འགྱུར་ཏེ། །
en: When the Guide had answered, Mahāprabha the nāga felt joy and delight.

source: གཞལ་དུ་མེད་པའི་བདེ་བས་སེམས་དགའ་ནས། །ཡོན་ཏན་ཕ་རོལ་གཤེགས་ལ་ཕྱག་འཚལ་བྱེད། །
en: Thrilled, in a state of unfathomable elation, He paid homage to the One with Transcendent Qualities:
